Repository: airtaxi/DeskBorder
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp, zh_hans, zh_hant

# AppDescription
source: DeskBorder service bootstrap application
ja_jp: DeskBorder サービス ブートストラップ アプリケーション
zh_hans: DeskBorder 服务启动应用
zh_hant: DeskBorder 服務啟動應用程式

# Common.Disabled
source: Disabled
ja_jp: 無効
zh_hans: 禁用
zh_hant: 停用

# Common.Enabled
source: Enabled
ja_jp: 有効
zh_hans: 启用
zh_hant: 啟用

# Common.Hidden
source: Hidden
ja_jp: 非表示
zh_hans: 隐藏
zh_hant: 隱藏

# Common.None
source: None
ja_jp: なし
zh_hans: 无
zh_hant: 無

# Common.Visible
source: Visible
ja_jp: 表示中
zh_hans: 可见
zh_hant: 顯示中

# Dashboard.AutoDeleteSummary.Format
source: Auto delete: {0}, blacklist entries: {1}
ja_jp: 自動削除: {0}、ブラックリスト項目: {1}
zh_hans: 自动删除：{0}，黑名单条目：{1}
zh_hant: 自動刪除：{0}，黑名單項目：{1}

# Dashboard.CurrentEdge.Format
source: Current edge: {0}
ja_jp: 現在のエッジ: {0}
zh_hans: 当前边缘：{0}
zh_hant: 目前邊緣：{0}

# Dashboard.DisplayCount.Format
source: Display count: {0} / {1}
ja_jp: ディスプレイ数: {0} / {1}
zh_hans: 显示器数量：{0} / {1}
zh_hant: 顯示器數量：{0} / {1}

# Dashboard.EmptyDesktopDetection.Format
source: Empty desktop detection: {0}
ja_jp: 空のデスクトップ検出: {0}
zh_hans: 空桌面检测：{0}
zh_hant: 空桌面偵測：{0}

# Dashboard.Hotkey.MoveNextFormat
source: Move window to next desktop: {0}
ja_jp: ウィンドウを次のデスクトップへ移動: {0}
zh_hans: 将窗口移到下一个桌面：{0}
zh_hant: 將視窗移到下一個桌面：{0}

# Dashboard.Hotkey.MovePreviousFormat
source: Move window to previous desktop: {0}
ja_jp: ウィンドウを前のデスクトップへ移動: {0}
zh_hans: 将窗口移到上一个桌面：{0}
zh_hant: 將視窗移到上一個桌面：{0}

# Dashboard.Hotkey.NavigatorToggleFormat
source: Toggle Navigator: {0}
ja_jp: Navigator の切り替え: {0}
zh_hans: 切换 Navigator：{0}
zh_hant: 切換 Navigator：{0}

# Dashboard.Hotkey.ToggleDeskBorderFormat
source: Toggle DeskBorder: {0}
ja_jp: DeskBorder の切り替え: {0}
zh_hans: 切换 DeskBorder：{0}
zh_hant: 切換 DeskBorder：{0}

# Dashboard.HotkeyModifiers.Format
source: Switch desktop: {0} / Create: {1}
ja_jp: デスクトップ切り替え: {0} / 作成: {1}
zh_hans: 切换桌面：{0} / 创建：{1}
zh_hant: 切換桌面：{0} / 建立：{1}

# Dashboard.HotkeyService.Initializing
source: The global hotkey service is still initializing.
ja_jp: グローバル ホットキー サービスは初期化中です。
zh_hans: 全局热键服务正在初始化。
zh_hant: 全域熱鍵服務正在初始化。

# Dashboard.HotkeyService.Ready
source: The global hotkey service is ready.
ja_jp: グローバル ホットキー サービスの準備ができました。
zh_hans: 全局热键服务已就绪。
zh_hant: 全域熱鍵服務已就緒。

# Dashboard.Monitoring.Running
source: The edge monitoring loop is running.
ja_jp: エッジ監視ループは実行中です。
zh_hans: 边缘监视循环正在运行。
zh_hant: 邊緣監視迴圈正在執行。

# Dashboard.Monitoring.Stopped
source: The edge monitoring loop is currently stopped.
ja_jp: エッジ監視ループは現在停止しています。
zh_hans: 边缘监视循环当前已停止。
zh_hant: 邊緣監視迴圈目前已停止。

# Dashboard.NavigatorAreaPosition.Format
source: Area position: {0}
ja_jp: 領域の位置: {0}
zh_hans: 区域位置：{0}
zh_hant: 區域位置：{0}

# Dashboard.NavigatorOverlay.Format
source: Navigator mini map: {0}
ja_jp: Navigator ミニマップ: {0}
zh_hans: Navigator 缩略图：{0}
zh_hant: Navigator 縮圖：{0}

# Dashboard.NavigatorTriggerArea.Format
source: Trigger area: {0}
ja_jp: トリガー領域: {0}
zh_hans: 触发区域：{0}
zh_hant: 觸發區域：{0}

# Dashboard.Status.ApplyFailedTitle
source: Failed to apply settings
ja_jp: 設定の適用に失敗しました
zh_hans: 应用设置失败
zh_hant: 套用設定失敗

# Dashboard.ToggleRuntime.Disable
source: Disable DeskBorder
ja_jp: DeskBorder を無効化
zh_hans: 禁用 DeskBorder
zh_hant: 停用 DeskBorder

# Dashboard.ToggleRuntime.Enable
source: Enable DeskBorder
ja_jp: DeskBorder を有効化
zh_hans: 启用 DeskBorder
zh_hant: 啟用 DeskBorder

# DashboardPage_DescriptionTextBlock.Text
source: View live status, quick toggles, Navigator, and monitoring details from one screen.
ja_jp: ライブ状態、クイック切り替え、Navigator、監視の詳細を 1 つの画面で確認できます。
zh_hans: 可在一个界面中查看实时状态、快速切换、Navigator 和监视详情。
zh_hant: 可在單一畫面查看即時狀態、快速切換、Navigator 與監視詳細資訊。

# DashboardPage_HotkeyTitleTextBlock.Text
source: Hotkey configuration
ja_jp: ホットキー構成
zh_hans: 热键配置
zh_hant: 熱鍵設定

# DashboardPage_LaunchOnStartupToggleSwitch.Header
source: Run at system startup
ja_jp: システム起動時に実行
zh_hans: 随系统启动运行
zh_hant: 系統啟動時執行

# DashboardPage_NavigatorTitleTextBlock.Text
source: Navigator mini map and monitoring
ja_jp: Navigator ミニマップと監視
zh_hans: Navigator 缩略图与监视
zh_hant: Navigator 縮圖與監視

# DashboardPage_OpenNavigatorSettingsButton.Content
source: Navigator settings
ja_jp: Navigator 設定
zh_hans: Navigator 设置
zh_hant: Navigator 設定

# DashboardPage_OpenSettingsButton.Content
source: Open detailed settings
ja_jp: 詳細設定を開く
zh_hans: 打开详细设置
zh_hant: 開啟詳細設定

# DashboardPage_QuickTogglesTitleTextBlock.Text
source: Quick toggles
ja_jp: クイック切り替え
zh_hans: 快速切换
zh_hant: 快速切換

# DashboardPage_ServiceStatusTitleTextBlock.Text
source: Service status
ja_jp: サービス状態
zh_hans: 服务状态
zh_hant: 服務狀態

# DashboardPage_StoreUpdateCheckToggleSwitch.Header
source: Check for Store updates
ja_jp: Store 更新を自動確認
zh_hans: 检查 Store 更新
zh_hant: 自動檢查 Store 更新

# DashboardPage_ToggleNavigatorButton.Content
source: Show Navigator mini map
ja_jp: Navigator ミニマップを表示
zh_hans: 显示 Navigator 缩略图
zh_hant: 顯示 Navigator 縮圖

# Desktop.DisplayNameFormat
source: Desktop {0}
ja_jp: デスクトップ {0}
zh_hans: 桌面 {0}
zh_hant: 桌面 {0}

# DesktopEdgeAvailability.CursorOutsideDisplayEnvironment
source: Cursor is outside the display environment
ja_jp: カーソルがディスプレイ領域の外にあります
zh_hans: 光标位于显示区域之外
zh_hant: 游標位於顯示區域之外

# DesktopEdgeAvailability.DisabledByDeskBorderSetting
source: DeskBorder disabled
ja_jp: DeskBorder は無効です
zh_hans: DeskBorder 已禁用
zh_hant: DeskBorder 已停用

# DesktopEdgeAvailability.DisabledByCursorClipping
source: Disabled because another app is clipping the cursor
ja_jp: 別のアプリがカーソルをクリップしているため無効です
zh_hans: 由于其他应用限制了光标范围，已禁用
zh_hant: 由於其他應用限制了游標範圍，已停用

# DesktopEdgeAvailability.DisabledInMultiDisplayEnvironment
source: Disabled in multi-display environments
ja_jp: マルチディスプレイ環境では無効です
zh_hans: 在多显示器环境中已禁用
zh_hant: 在多顯示器環境中已停用

# DesktopEdgeAvailability.Enabled
source: Edge monitoring available
ja_jp: エッジ監視が利用可能です
zh_hans: 可进行边缘监视
zh_hant: 可使用邊緣監視

# DesktopEdgeKind.LeftOuterDisplayEdge
source: Left outer edge
ja_jp: 左側の外側エッジ
zh_hans: 左侧外边缘
zh_hant: 左側外邊緣

# DesktopEdgeKind.None
source: No outer edge detected
ja_jp: 外側のエッジは検出されていません
zh_hans: 未检测到外侧边缘
zh_hant: 未偵測到外側邊緣

# DesktopEdgeKind.RightOuterDisplayEdge
source: Right outer edge
ja_jp: 右側の外側エッジ
zh_hans: 右侧外边缘
zh_hant: 右側外邊緣

# EmptyDesktopDetectionMode.CountAllTopLevelWindows
source: Count all top-level windows
ja_jp: すべてのトップレベル ウィンドウを含める
zh_hans: 统计所有顶级窗口
zh_hant: 計算所有最上層視窗

# EmptyDesktopDetectionMode.IgnoreNotificationAreaApplications
source: Ignore notification area apps
ja_jp: 通知領域アプリを除外
zh_hans: 忽略通知区域应用
zh_hant: 忽略通知區域應用程式

# KeyboardShortcut.KeyNotSpecified
source: No key selected
ja_jp: キーが未指定です
zh_hans: 未指定按键
zh_hant: 未指定按鍵

# ManageWindow.ExitApplication
source: Exit application
ja_jp: アプリケーションを終了
zh_hans: 退出应用
zh_hant: 結束應用程式

# ManageWindow.Navigation.Dashboard
source: Dashboard
ja_jp: ダッシュボード
zh_hans: 仪表板
zh_hant: 儀表板

# ManageWindow.Navigation.Settings
source: Settings
ja_jp: 設定
zh_hans: 设置
zh_hant: 設定

# ManageWindow.OpenManageWindow
source: Open management window
ja_jp: 管理ウィンドウを開く
zh_hans: 打开管理窗口
zh_hant: 開啟管理視窗

# ManageWindow.ShowNavigator
source: Show Navigator mini map
ja_jp: Navigator ミニマップを表示
zh_hans: 显示 Navigator 缩略图
zh_hant: 顯示 Navigator 縮圖

# MultiDisplayBehavior.DisableInMultiDisplayEnvironment
source: Disable edge monitoring in multi-display environments
ja_jp: マルチディスプレイ環境ではエッジ監視を無効化
zh_hans: 在多显示器环境中禁用边缘监视
zh_hant: 在多顯示器環境中停用邊緣監視

# MultiDisplayBehavior.UseOuterDisplayEdges
source: Use only the outermost display edges
ja_jp: 最も外側のディスプレイ エッジのみを使用
zh_hans: 仅使用最外侧显示器边缘
zh_hant: 僅使用最外側顯示器邊緣

# Navigator.CurrentBadgeText
source: Current
ja_jp: 現在
zh_hans: 当前
zh_hant: 目前

# Navigator.DesktopDescription.Current
source: Current desktop
ja_jp: 現在のデスクトップ
zh_hans: 当前桌面
zh_hant: 目前桌面

# Navigator.DesktopDescription.Outer
source: Outer desktop
ja_jp: 外側のデスクトップ
zh_hans: 外侧桌面
zh_hant: 外側桌面

# Navigator.DesktopDescription.PlaceholderCurrent
source: Current desktop placeholder
ja_jp: 現在のデスクトップ プレースホルダー
zh_hans: 当前桌面占位项
zh_hant: 目前桌面預留位置

# Navigator.DesktopDescription.PlaceholderPreview
source: Desktop preview placeholder
ja_jp: デスクトップ プレビュー プレースホルダー
zh_hans: 桌面预览占位项
zh_hant: 桌面預覽預留位置

# Navigator.DesktopDescription.Virtual
source: Virtual desktop
ja_jp: 仮想デスクトップ
zh_hans: 虚拟桌面
zh_hant: 虛擬桌面

# Navigator.Interaction.Active
source: The Navigator overlay is active.
ja_jp: Navigator オーバーレイがアクティブです。
zh_hans: Navigator 叠加层处于活动状态。
zh_hant: Navigator 覆疊層處於作用中。

# Navigator.Interaction.Hidden
source: The Navigator overlay is hidden.
ja_jp: Navigator オーバーレイは非表示です。
zh_hans: Navigator 叠加层已隐藏。
zh_hant: Navigator 覆疊層已隱藏。

# Navigator.Interaction.Visible
source: The Navigator overlay is visible.
ja_jp: Navigator オーバーレイが表示されています。
zh_hans: Navigator 叠加层正在显示。
zh_hant: Navigator 覆疊層正在顯示。

# Navigator.LastRequestedDesktop.None
source: No desktop has been requested yet.
ja_jp: まだデスクトップの選択要求はありません。
zh_hans: 尚未请求任何桌面。
zh_hant: 尚未要求任何桌面。

# Navigator.TriggerAreaDisabled
source: The trigger area is turned off.
ja_jp: トリガー領域はオフです。
zh_hans: 触发区域已关闭。
zh_hant: 觸發區域已關閉。

# Navigator.TriggerAreaEnabledFormat
source: Trigger area: {0}
ja_jp: トリガー領域: {0}
zh_hans: 触发区域：{0}
zh_hant: 觸發區域：{0}

# Navigator.TriggerAreaTitle
source: Trigger area
ja_jp: トリガー領域
zh_hans: 触发区域
zh_hant: 觸發區域

# Runtime.Status.Running
source: The DeskBorder background service is running and the desktop lifecycle is ready.
ja_jp: DeskBorder バックグラウンド サービスは実行中で、デスクトップ ライフサイクルの準備ができています。
zh_hans: DeskBorder 后台服务正在运行，桌面生命周期已就绪。
zh_hant: DeskBorder 背景服務正在執行，桌面生命週期已就緒。

# Runtime.Status.Stopped
source: The DeskBorder background service is stopped, so only settings and the manual overlay are available.
ja_jp: DeskBorder バックグラウンド サービスは停止中のため、設定と手動オーバーレイのみ利用できます。
zh_hans: DeskBorder 后台服务已停止，因此只能使用设置和手动叠加层。
zh_hant: DeskBorder 背景服務已停止，因此只能使用設定與手動覆疊層。

# Runtime.Status.Paused
source: The DeskBorder background service is paused and will resume after the selection overlay closes.
ja_jp: DeskBorder バックグラウンド サービスは一時停止中で、選択オーバーレイが閉じると再開されます。
zh_hans: DeskBorder 后台服务已暂停，并会在选择叠加层关闭后继续运行。
zh_hant: DeskBorder 背景服務已暫停，並會在選取覆疊層關閉後繼續執行。

# Settings.AppLanguage.ChineseSimplified
source: Chinese (Simplified)
ja_jp: 中国語 (簡体字)
zh_hans: 简体中文
zh_hant: 簡體中文

# Settings.AppLanguage.ChineseTraditional
source: Chinese (Traditional)
ja_jp: 中国語 (繁体字)
zh_hans: 繁體中文
zh_hant: 繁體中文

# Settings.AppLanguage.English
source: English
ja_jp: 英語
zh_hans: 英语
zh_hant: 英文

# Settings.AppLanguage.Japanese
source: Japanese
ja_jp: 日本語
zh_hans: 日语
zh_hant: 日文

# Settings.AppLanguage.Korean
source: Korean
ja_jp: 韓国語
zh_hans: 韩语
zh_hant: 韓文

# Settings.AppLanguage.System
source: System default
ja_jp: システム既定
zh_hans: 系统默认
zh_hant: 系統預設

# Settings.Blacklist.AddFailedTitle
source: Failed to add blacklist entry
ja_jp: ブラックリストへの追加に失敗しました
zh_hans: 添加黑名单条目失败
zh_hant: 新增黑名單項目失敗

# Settings.Blacklist.NoAvailableForegroundProcessesMessage
source: There are no running foreground processes available to add to the blacklist.
ja_jp: ブラックリストに追加できる実行中のフォアグラウンド プロセスはありません。
zh_hans: 没有可添加到黑名单的正在运行的前台进程。
zh_hant: 沒有可加入黑名單的執行中前景處理程序。

# Settings.Blacklist.NoAvailableForegroundProcessesTitle
source: No processes to add
ja_jp: 追加できるプロセスがありません
zh_hans: 没有可添加的进程
zh_hant: 沒有可加入的處理程序

# Settings.Export.CancelledMessage
source: Settings export was cancelled.
ja_jp: 設定のエクスポートはキャンセルされました。
zh_hans: 已取消设置导出。
zh_hant: 已取消設定匯出。

# Settings.Export.CancelledTitle
source: Export cancelled
ja_jp: エクスポートをキャンセルしました
zh_hans: 已取消导出
zh_hant: 已取消匯出

# Settings.Export.FailedTitle
source: Export failed
ja_jp: エクスポートに失敗しました
zh_hans: 导出失败
zh_hant: 匯出失敗

# Settings.Export.FileTypeDisplayName
source: DeskBorder settings
ja_jp: DeskBorder 設定
zh_hans: DeskBorder 设置
zh_hant: DeskBorder 設定

# Settings.Export.SuccessMessageFormat
source: Saved current settings to '{0}'.
ja_jp: 現在の設定を '{0}' に保存しました。
zh_hans: 已将当前设置保存到 '{0}'。
zh_hant: 已將目前設定儲存到 '{0}'。

# Settings.Export.SuccessTitle
source: Export complete
ja_jp: エクスポート完了
zh_hans: 导出完成
zh_hant: 匯出完成

# Settings.HotkeyValidation.Disabled
source: Disabled
ja_jp: 無効
zh_hans: 已禁用
zh_hant: 已停用

# Settings.HotkeyValidation.Duplicate
source: Duplicates another global hotkey
ja_jp: 他のグローバル ホットキーと重複しています
zh_hans: 与其他全局热键重复
zh_hant: 與其他全域熱鍵重複

# Settings.HotkeyValidation.MissingKey
source: Primary key required
ja_jp: メイン キーを選択してください
zh_hans: 必须选择主按键
zh_hant: 必須選擇主要按鍵

# Settings.HotkeyValidation.RegistrationFailed
source: Cannot register this hotkey right now
ja_jp: 現在は登録できないホットキーです
zh_hans: 当前无法注册此热键
zh_hant: 目前無法註冊此熱鍵

# Settings.HotkeyValidation.Valid
source: Hotkey is valid
ja_jp: 有効なホットキーです
zh_hans: 热键有效
zh_hant: 熱鍵有效

# Settings.Import.CancelledMessage
source: Settings import was cancelled.
ja_jp: 設定のインポートはキャンセルされました。
zh_hans: 已取消设置导入。
zh_hant: 已取消設定匯入。

# Settings.Import.CancelledTitle
source: Import cancelled
ja_jp: インポートをキャンセルしました
zh_hans: 已取消导入
zh_hant: 已取消匯入

# Settings.Import.FailedTitle
source: Import failed
ja_jp: インポートに失敗しました
zh_hans: 导入失败
zh_hant: 匯入失敗

# Settings.Import.SuccessMessageFormat
source: Applied settings from '{0}'.
ja_jp: '{0}' の設定を適用しました。
zh_hans: 已应用来自 '{0}' 的设置。
zh_hant: 已套用來自 '{0}' 的設定。

# Settings.Import.SuccessTitle
source: Import complete
ja_jp: インポート完了
zh_hans: 导入完成
zh_hant: 匯入完成

# Settings.Status.ApplyFailedTitle
source: Failed to apply settings
ja_jp: 設定の適用に失敗しました
zh_hans: 应用设置失败
zh_hant: 套用設定失敗

# Settings.Validation.ProcessAlreadyBlacklisted
source: That process is already blacklisted.
ja_jp: そのプロセスは既にブラックリストに含まれています。
zh_hans: 该进程已在黑名单中。
zh_hant: 該處理程序已在黑名單中。

# Settings.Validation.HotkeyDuplicateFormat
source: {0} duplicates {1}.
ja_jp: {0} が {1} と重複しています。
zh_hans: {0} 与 {1} 重复。
zh_hant: {0} 與 {1} 重複。

# Settings.Validation.HotkeyMissingKeyFormat
source: {0} must specify a primary key when enabled.
ja_jp: {0} を使うにはメイン キーを指定する必要があります。
zh_hans: 启用 {0} 时必须指定主按键。
zh_hant: 啟用 {0} 時必須指定主要按鍵。

# Settings.Validation.ProcessNameRequired
source: Enter a process name.
ja_jp: プロセス名を入力してください。
zh_hans: 请输入进程名称。
zh_hant: 請輸入處理程序名稱。

# SettingsPage_AddBlacklistedProcessNameButton.Content
source: Add from running processes
ja_jp: 実行中のプロセスから追加
zh_hans: 从正在运行的进程中添加
zh_hant: 從執行中的處理程序加入

# SettingsPage_AppLanguagePreferenceComboBox.Header
source: App language
ja_jp: アプリの言語
zh_hans: 应用语言
zh_hant: 應用程式語言

# SettingsPage_AutoDeleteToggleSwitch.Header
source: Auto delete empty desktops
ja_jp: 空のデスクトップを自動削除
zh_hans: 自动删除空桌面
zh_hant: 自動刪除空桌面

# SettingsPage_AutoDeleteWarningTimeoutDescriptionTextBlock.Text
source: Adjust how long DeskBorder waits for undo while the deletion warning is shown.
ja_jp: 削除前の警告を表示している間、取り消しを待つ時間を調整します。
zh_hans: 调整显示删除警告时等待撤销的时间。
zh_hant: 調整顯示刪除警告時等待復原的時間。

# SettingsPage_AutoDeleteWarningTimeoutSecondsNumberBox.Header
source: Deletion warning timeout (seconds)
ja_jp: 削除前の警告タイムアウト (秒)
zh_hans: 删除警告超时（秒）
zh_hant: 刪除警告逾時（秒）

# SettingsPage_AutoDeleteWarningToggleSwitch.Header
source: Show deletion warning
ja_jp: 削除前の警告を表示
zh_hans: 显示删除警告
zh_hant: 顯示刪除警告

# SettingsPage_BlacklistSectionDescriptionTextBlock.Text
source: Manage running foreground processes to exclude from edge handling.
ja_jp: エッジ処理から除外する実行中のフォアグラウンド プロセスを管理します。
zh_hans: 管理要从边缘处理中排除的正在运行的前台进程。
zh_hant: 管理要從邊緣處理中排除的執行中前景處理程序。

# ForegroundProcessSelectionDialog.CloseButtonText
source: Cancel
ja_jp: キャンセル
zh_hans: 取消
zh_hant: 取消

# ForegroundProcessSelectionDialog.PrimaryButtonText
source: Add
ja_jp: 追加
zh_hans: 添加
zh_hant: 加入

# ForegroundProcessSelectionDialog.Title
source: Add from running processes
ja_jp: 実行中のプロセスから追加
zh_hans: 从正在运行的进程中添加
zh_hant: 從執行中的處理程序加入

# ForegroundProcessSelectionDialog_DescriptionTextBlock.Text
source: Select running foreground processes that are not already in the blacklist.
ja_jp: 現在実行中のフォアグラウンド プロセスのうち、まだブラックリストにない項目を選択してください。
zh_hans: 请选择当前正在运行且尚未加入黑名单的前台进程。
zh_hant: 請選擇目前執行中且尚未加入黑名單的前景處理程序。

# SettingsPage_BlacklistSectionTitleTextBlock.Text
source: Blacklist
ja_jp: ブラックリスト
zh_hans: 黑名单
zh_hant: 黑名單

# SettingsPage_CreateDesktopModifierTitleTextBlock.Text
source: Desktop creation modifiers
ja_jp: デスクトップ作成修飾キー
zh_hans: 创建桌面修饰键
zh_hant: 建立桌面修飾鍵

# SettingsPage_DeskBorderEnabledToggleSwitch.Header
source: Enable DeskBorder
ja_jp: DeskBorder を有効化
zh_hans: 启用 DeskBorder
zh_hant: 啟用 DeskBorder

# SettingsPage_EdgeSectionDescriptionTextBlock.Text
source: Configure multi-display behavior, auto deletion, and edge ignore zones.
ja_jp: マルチディスプレイ動作、自動削除、エッジ無視領域を設定します。
zh_hans: 配置多显示器行为、自动删除和边缘忽略区域。
zh_hant: 設定多顯示器行為、自動刪除與邊緣忽略區域。

# SettingsPage_EdgeSectionTitleTextBlock.Text
source: Edges and auto cleanup
ja_jp: エッジと自動整理
zh_hans: 边缘与自动整理
zh_hant: 邊緣與自動整理

# SettingsPage_EmptyDesktopDetectionModeComboBox.Header
source: Empty desktop detection
ja_jp: 空のデスクトップ検出
zh_hans: 空桌面检测
zh_hant: 空桌面偵測

# SettingsPage_BottomDesktopEdgeIgnorePercentageNumberBox.Header
source: Bottom ignore zone (%)
ja_jp: 下側の無視領域 (%)
zh_hans: 底部忽略区域 (%)
zh_hant: 底部忽略區域 (%)

# SettingsPage_ExportSettingsButton.Content
source: Export settings
ja_jp: 設定をエクスポート
zh_hans: 导出设置
zh_hant: 匯出設定

# SettingsPage_GeneralSectionDescriptionTextBlock.Text
source: Configure overall behavior, startup options, and update checks.
ja_jp: 全体の動作、起動オプション、更新確認を設定します。
zh_hans: 配置整体行为、启动选项和更新检查。
zh_hant: 設定整體行為、啟動選項與更新檢查。

# SettingsPage_GeneralSectionTitleTextBlock.Text
source: General
ja_jp: 全般
zh_hans: 常规
zh_hant: 一般

# SettingsPage_GeneralSectionTeachingTip.Title
source: General settings guide
ja_jp: 全般設定ガイド
zh_hans: 常规设置说明
zh_hant: 一般設定說明

# SettingsPage_GeneralSectionTeachingTipContentTextBlock.Text
source: • Enable DeskBorder: turns edge switching, desktop creation, auto cleanup, and global hotkeys on or off together. • Run at system startup: starts the app in the tray right after Windows sign-in. • Check for Store updates: keeps update checks enabled for Store-distributed builds. • Multi-display behavior: disables monitoring on multi-monitor setups, or limits it to the outermost display edges only. • App language: pins the UI to a specific language or follows the system language.
ja_jp: • DeskBorder を有効化: エッジ切り替え、デスクトップ作成、自動整理、グローバル ホットキーをまとめてオンまたはオフにします。 • システム起動時に実行: Windows サインイン直後にアプリをトレイで起動します。 • Store 更新の自動確認: 有効にすると 8 時間ごとに Microsoft Store の更新を確認し、新しいバージョンがある場合はシステム トーストを表示します。 • 今すぐ更新を確認: Microsoft Store で新しいバージョンをすぐに確認し、更新がある場合は製品ページを開けます。 • マルチディスプレイ動作: マルチモニターでは監視を無効化するか、最も外側のディスプレイ端だけで動作させます。 • アプリの言語: UI 言語を固定するか、システム言語に従わせます。
zh_hans: • 启用 DeskBorder：统一开启或关闭边缘切换、桌面创建、自动整理和全局热键。 • 随系统启动运行：在 Windows 登录后立即以托盘方式启动应用。 • 检查 Store 更新：为 Store 分发版本保留更新检查行为。 • 多显示器行为：在多显示器环境下禁用监控，或仅在最外侧显示器边缘生效。 • 应用语言：将界面固定为指定语言，或跟随系统语言。
zh_hant: • 啟用 DeskBorder：統一開啟或關閉邊緣切換、桌面建立、自動整理與全域熱鍵。 • 系統啟動時執行：在 Windows 登入後立即以系統匣方式啟動應用程式。 • 自動檢查 Store 更新：啟用後每 8 小時檢查一次 Microsoft Store 更新，有新版本時顯示系統通知。 • 立即檢查更新：立即在 Microsoft Store 中檢查新版本，並在有更新時開啟產品頁面。 • 多顯示器行為：在多螢幕環境中停用監視，或只在最外側顯示器邊緣啟用。 • 應用程式語言：將介面固定為指定語言，或跟隨系統語言。

# SettingsPage_HotkeysSectionDescriptionTextBlock.Text
source: Configure hotkeys that directly control DeskBorder, window movement, and Navigator.
ja_jp: DeskBorder、ウィンドウ移動、Navigator を直接制御するホットキーを設定します。
zh_hans: 配置可直接控制 DeskBorder、窗口移动和 Navigator 的热键。
zh_hant: 設定可直接控制 DeskBorder、視窗移動與 Navigator 的熱鍵。

# SettingsPage_HotkeysSectionTitleTextBlock.Text
source: Global hotkeys
ja_jp: グローバル ホットキー
zh_hans: 全局热键
zh_hant: 全域熱鍵

# SettingsPage_HotkeysSectionTeachingTip.Title
source: Global hotkey guide
ja_jp: グローバル ホットキー ガイド
zh_hans: 全局热键说明
zh_hant: 全域熱鍵說明

# SettingsPage_HotkeysSectionTeachingTipContentTextBlock.Text
source: • Each global hotkey can be enabled or disabled independently. • Combine a primary key with modifiers to configure the DeskBorder toggle, move focused window to previous desktop, move focused window to next desktop, and Navigator overlay toggle actions. • The status indicator immediately shows whether the shortcut is valid, missing a key, duplicated, or failed to register.
ja_jp: • 各グローバル ホットキーは機能ごとに個別に有効化または無効化できます。 • メイン キーと修飾キーを組み合わせて、DeskBorder の切り替え、フォーカス中ウィンドウの前後デスクトップ移動、Navigator オーバーレイ切り替えを設定します。 • 状態インジケーターは、その組み合わせが有効か、キー未指定か、重複か、登録失敗かをすぐに示します。
zh_hans: • 每个全局热键都可以单独启用或关闭。 • 通过主按键与修饰键的组合，可设置 DeskBorder 总开关、将焦点窗口移到上一个桌面、移到下一个桌面，以及切换 Navigator 叠加层。 • 状态指示会立即显示当前组合是否有效、是否缺少按键、是否重复，或是否注册失败。
zh_hant: • 每個全域熱鍵都可以獨立啟用或停用。 • 透過主要按鍵與修飾鍵的組合，可設定 DeskBorder 總開關、將焦點視窗移到上一個桌面、移到下一個桌面，以及切換 Navigator 覆疊層。 • 狀態指示會立即顯示目前組合是否有效、是否缺少按鍵、是否重複，或是否註冊失敗。

# SettingsPage_ImportExportSectionDescriptionTextBlock.Text
source: Save the current settings to a .dbs file, or apply a saved settings file to the current app state.
ja_jp: .dbs ファイルに現在の設定を保存したり、保存済みファイルを現在のアプリ状態へ適用したりできます。
zh_hans: 可将当前设置保存为 .dbs 文件，或将已保存的设置文件应用到当前应用状态。
zh_hant: 可將目前設定儲存為 .dbs 檔案，或將已儲存的設定檔套用到目前應用程式狀態。

# SettingsPage_ImportExportSectionTitleTextBlock.Text
source: Import and export settings
ja_jp: 設定のインポートとエクスポート
zh_hans: 导入和导出设置
zh_hant: 匯入與匯出設定

# SettingsPage_ImportExportSectionTeachingTip.Title
source: Import and export guide
ja_jp: インポートとエクスポートのガイド
zh_hans: 导入和导出说明
zh_hant: 匯入與匯出說明

# SettingsPage_ImportExportSectionTeachingTipContentTextBlock.Text
source: • Export settings: saves the current app configuration to a .dbs file for backup or transfer to another PC. • Import settings: loads a saved .dbs file and applies it to the current configuration in one step. • The info bar below briefly shows import and export results or errors.
ja_jp: • 設定をエクスポート: 現在のアプリ設定を .dbs ファイルとして保存し、バックアップや別 PC への移行に使えます。 • 設定をインポート: 保存済みの .dbs ファイルを読み込み、現在の設定へ一度に適用します。 • 下の情報バーは、インポートやエクスポートの結果やエラーを短時間表示します。
zh_hans: • 导出设置：将当前应用配置保存为 .dbs 文件，便于备份或迁移到另一台电脑。 • 导入设置：读取已保存的 .dbs 文件，并一次性应用到当前配置。 • 下方信息栏会短暂显示导入导出的结果或错误。
zh_hant: • 匯出設定：將目前應用程式設定儲存為 .dbs 檔案，方便備份或移到另一台電腦。 • 匯入設定：讀取已儲存的 .dbs 檔案，並一次套用到目前設定。 • 下方資訊列會短暫顯示匯入匯出的結果或錯誤。

# SettingsPage_ImportSettingsButton.Content
source: Import settings
ja_jp: 設定をインポート
zh_hans: 导入设置
zh_hant: 匯入設定

# SettingsPage_LaunchOnStartupToggleSwitch.Header
source: Run at system startup
ja_jp: システム起動時に実行
zh_hans: 随系统启动运行
zh_hant: 系統啟動時執行

# SettingsPage_MoveNextHotkeyKeyComboBox.Header
source: Primary key
ja_jp: メイン キー
zh_hans: 主按键
zh_hant: 主要按鍵

# SettingsPage_MoveNextHotkeyModifierTextBlock.Text
source: Modifiers
ja_jp: 修飾キー
zh_hans: 修饰键
zh_hant: 修飾鍵

# SettingsPage_MoveNextHotkeyToggleSwitch.Header
source: Move window to next desktop
ja_jp: ウィンドウを次のデスクトップへ移動
zh_hans: 将窗口移到下一个桌面
zh_hant: 將視窗移到下一個桌面

# SettingsPage_MovePreviousHotkeyKeyComboBox.Header
source: Primary key
ja_jp: メイン キー
zh_hans: 主按键
zh_hant: 主要按鍵

# SettingsPage_MovePreviousHotkeyModifierTextBlock.Text
source: Modifiers
ja_jp: 修飾キー
zh_hans: 修饰键
zh_hant: 修飾鍵

# SettingsPage_MovePreviousHotkeyToggleSwitch.Header
source: Move window to previous desktop
ja_jp: ウィンドウを前のデスクトップへ移動
zh_hans: 将窗口移到上一个桌面
zh_hant: 將視窗移到上一個桌面

# SettingsPage_MultiDisplayBehaviorComboBox.Header
source: Multi-display behavior
ja_jp: マルチディスプレイ動作
zh_hans: 多显示器行为
zh_hant: 多顯示器行為

# SettingsPage_NavigatorSectionDescriptionTextBlock.Text
source: Configure the hotkey and mouse trigger area for the display-only Navigator mini map.
ja_jp: 表示専用の Navigator ミニマップ用ホットキーとマウス トリガー領域を設定します。
zh_hans: 配置仅用于显示的 Navigator 缩略图热键和鼠标触发区域。
zh_hant: 設定僅供顯示的 Navigator 縮圖熱鍵與滑鼠觸發區域。

# SettingsPage_NavigatorSectionTeachingTip.Title
source: Navigator guide
ja_jp: Navigator ガイド
zh_hans: Navigator 说明
zh_hant: Navigator 說明
